#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
int main()
{
	int a = 13;		//00000000000000000000000000001101 补码
	int b = 0;
	//倒数第五位添1，即变为00000000000000000000000000011101
	//即让b=29
	//可以 | 上1左移n-1位即0000 0000 0000 0000 0000 0000 0000 0001
	//左移5-1位 即1<<4 0000 0000 0000 0000 0000 0000 0001 0000
	//有一为真即为真 变为00000000000000000000000000011101
	b = a | 1 << 4;
	printf("b = %d\n", b);
	//添0就需要取反操作了，用& ，其它一样，同真才为真
	//给倒数第三位变为0即1101变为1001，可以 & 1011达成效果
	//1011是通过取反0100得到的，那还是通过1<<n-1位得到的，
	//第三位就是1<<2
	a &= (~(1 << 2));//用a & 上先左移再取反的1，
	printf("a = %d\n", a);//a = 9
	return 0;
}