#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>
int main()
{
	char a = 5;//整型赋值给char类型会发生截断
	char b = 126;//如126为00000000000000000000000001111110
	////发生截断后变为01111110，因定义的是有符号的char类型所以倒数第八位会被视为符号位
	char c = a + b;//等于00000101 + 01111110
	//c = 10000011 这时最左边的一会被视为符号，变为负数，内存里存的是补码
	//打印输出时负数需要先-1再取反得到源码，才是真正得到的数
	//打印的是整型，要进行整型提升，即根据符号位把8字节的char类型进行补齐至32个字节的整型
	//c这时是10000011，整型提升后变为11111111111111111111111110000011，这时还是补码
	//求反码后变为11111111111111111111111110000010，再取反得到源码，符号位不变
	//源码为10000000000000000000000001111101，即-125
	printf("c = %d\n", c);

	char x = 0xb6;//b6 = 1011 0110
	//111111111111111111111111 10110110 
	//源码为 1 01001010 等于 -75 
	short y = 0xb600;
	// 1011 0110 0000 0000 ,-1后为1011 0101 1111 1111
	//取反为 1 0100 1010 0000 0000
	//等于-18944
	int z = 0xb6000000;//1011 0110 00000000 00000000 00000000
	//1011 0101 11111111 11111111 11111111
	//1100 1010 00000000 00000000 00000000
	//-1241513984
	printf("%d %d %d\n", x, y, z);
	return 0;
}
